app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "jigar"], ["phone", "9773092605\r\n"], ["created_at", "2021-07-13 11:11:10.539544"], ["updated_at", "2021-07-13 11:11:10.539544"]]

  def update
    @user = User.find(params[:id])

    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "phone" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["phone", "9773092605234"], ["updated_at", "2021-07-13 11:34:37.642503"], ["id", 1]]